EDT/УТ/src/InformationRegisters/РассылкиКонтрагентов/РассылкиКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РассылкиКонтрагентов</name>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРассылки</name>
    <type>
      <types>EnumRef.ТипыРассылки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ТипыРассылки/ТипыРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРассылки</name>
  <enumValues>
    <name>АдминистративнаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>БухгалтерскаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>ТехническаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>СкладскаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>ФинансоваяРассылка</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЗаказов</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаАктовПриемаПередачи</name>
  </enumValues>
  <enumValues>
    <name>ЗаборнаяЛогистика</name>
  </enumValues>
  <enumValues>
    <name>КонтрольЗаказов</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/InformationRegisters/РассылкиКонтрагентов/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	ТаблицаЗаписей = ЭтотОбъект.Выгрузить(,"Контрагент,ТипРассылки,Почта");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Контрагент КАК Контрагент,
	               |	ТЗ.Почта КАК Почта,
	               |	ТЗ.ТипРассылки КАК ТипРассылки
	               |ПОМЕСТИТЬ втПочты
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |ГДЕ
	               |	ТЗ.ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылки.ЗагрузкаЗаказов)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втПочты.Почта КАК Почта,
	               |	втПочты.ТипРассылки КАК ТипРассылки,
	               |	РассылкиКонтрагентов.Контрагент.Наименование КАК КонтрагентНаименование
	               |ИЗ
	               |	втПочты КАК втПочты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РассылкиКонтрагентов КАК РассылкиКонтрагентов
	               |		ПО втПочты.Контрагент <> РассылкиКонтрагентов.Контрагент
	               |			И втПочты.Почта = РассылкиКонтрагентов.Почта
	               |			И втПочты.ТипРассылки = РассылкиКонтрагентов.ТипРассылки";
	Запрос.УстановитьПараметр("ТЗ",ТаблицаЗаписей);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВызватьИсключение "Почта уже используется для рассылки заказов " + Выборка.КонтрагентНаименование;
	КонецЕсли;	
КонецПроцедуры
